Revit 2027 API
Curve.ComputeRawParameter Method
Computes the raw parameter from the normalized parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ComputeRawParameter(
	double normalizedParameter
)
Public Function ComputeRawParameter (
	normalizedParameter As Double
) As Double
public:
double ComputeRawParameter(
	double normalizedParameter
)
member ComputeRawParameter :
        normalizedParameter : float -> float
Parameters
normalizedParameter Double
The normalized parameter.
Return Value
Double
The real number equal to the raw curve parameter.
Exceptions
Exception | Condition
ArgumentException |  Thrown when normalizedParameter is infinite.
InvalidOperationException |  Thrown when the curve is unbound.
See Also
Reference
Curve Class
Autodesk.Revit.DB Namespace